# Creation

In [3]:
import pandas as pd
data={"A":[1,2],"B":[3,4]}
df=pd.DataFrame(data)
df1=pd.Series(data)
df2=pd.read_csv("E:\\pythonprogs\\output.csv")
df3=pd.read_excel("E:\\pythonprogs\\Book2.xlsx")
print(df3)
print(df2)
print(df1)
print(df)

    Name   id
0   Ravi  169
1  Kiran  175
2   Hari  159
   A  B
0  1  3
1  2  4
A    [1, 2]
B    [3, 4]
dtype: object
   A  B
0  1  3
1  2  4

In [14]:
import pandas as pd
import pymysql
db_name="employee"
db_host="localhost"
db_username="root"
db_password="tejaMS123@"
conn=pymysql.connect(host=db_host,
                     user="root",
                     password="tejaMS123@",
                     db=db_name)
query="select * from emp"
df4=pd.read_sql(query,conn)
conn.close()
print(df4)

    empno   ename        job     mgr    hiredate      sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17   5000.0     NaN    10.0
1    7698   BLAKE    MANAGER  7839.0  1981-05-01   2850.0     NaN    30.0
2    7782   CLARK    MANAGER  7839.0  1981-06-09   2450.0     NaN    10.0
3    7566   JONES    MANAGER  7839.0  1981-04-02   2975.0     NaN    20.0
4    7788   Scott    ANALYST  7566.0  1987-07-13   3000.0     NaN    20.0
5    7902    FORD    ANALYST  7566.0  1981-12-03   3000.0     NaN    20.0
6    7369   SMITH      CLERK  7902.0  1980-12-17   3000.0     NaN    20.0
7    7499   ALLEN   SALESMAN  7698.0  1981-02-20   1600.0   300.0    30.0
8    7521    WARD   SALESMAN  7698.0  1981-02-22   1250.0   500.0    30.0
9    7654  MARTIN   SALESMAN  7698.0  1981-09-28   1250.0  1400.0    30.0
10   7844  TURNER   SALESMAN  7698.0  1981-09-08   1500.0     0.0    30.0
11   7876   ADAMS      CLERK  7788.0  1987-07-13   1100.0     NaN    20.0
12   7900   JAMES      CLERK  7698.0  1981-12-03    950.0     NaN    30.0
13   7934  MILLER      CLERK  7782.0  1982-01-23   1300.0     NaN    10.0
14   7777   tuski       None     NaN  1991-02-14      NaN     NaN     NaN
15   8888     eef       None     NaN  1991-12-12      NaN     NaN     NaN
16   3385    ewfe       None     NaN  1991-12-17      NaN     NaN     NaN
17   9090   SURYA       None     NaN  1990-12-12      NaN     NaN     NaN
18   3384   KRISH   SALESMAN  7783.0  1999-10-12   5000.0     0.0    10.0
19   9999  SURESH      CLERK  7785.0  1999-12-19   1200.0     0.0    20.0
20   3507     RAM    ANALYST  8768.0  1998-10-16  20000.0     0.0    80.0

C:\Users\DELL\AppData\Local\Temp\ipykernel_6988\4269463535.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4=pd.read_sql(query,conn)

# Inception

In [32]:
print(df4.head())

   empno  ename        job     mgr    hiredate     sal  comm  deptno
0   7839   KING  PRESIDENT     NaN  1981-11-17  5000.0   NaN    10.0
1   7698  BLAKE    MANAGER  7839.0  1981-05-01  2850.0   NaN    30.0
2   7782  CLARK    MANAGER  7839.0  1981-06-09  2450.0   NaN    10.0
3   7566  JONES    MANAGER  7839.0  1981-04-02  2975.0   NaN    20.0
4   7788  Scott    ANALYST  7566.0  1987-07-13  3000.0   NaN    20.0

In [34]:
print(df4.tail())

    empno   ename       job     mgr    hiredate      sal  comm  deptno
16   3385    ewfe      None     NaN  1991-12-17      NaN   NaN     NaN
17   9090   SURYA      None     NaN  1990-12-12      NaN   NaN     NaN
18   3384   KRISH  SALESMAN  7783.0  1999-10-12   5000.0   0.0    10.0
19   9999  SURESH     CLERK  7785.0  1999-12-19   1200.0   0.0    20.0
20   3507     RAM   ANALYST  8768.0  1998-10-16  20000.0   0.0    80.0

In [36]:
print(df4.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     21 non-null     int64
 1   ename     21 non-null     object
 2   job       17 non-null     object
 3   mgr       16 non-null     float64
 4   hiredate  21 non-null     object
 5   sal       17 non-null     float64
 6   comm      7 non-null      float64
 7   deptno    17 non-null     float64
dtypes: float64(4), int64(1), object(3)
memory usage: 1.4+ KB
None

In [44]:
print(df4.describe())

             empno          mgr           sal         comm     deptno
count    21.000000    16.000000     17.000000     7.000000  17.000000
mean   7342.952381  7809.187500   3377.941176   314.285714  24.705882
std    1749.415630   272.415667   4466.366343   517.779140  16.247172
min    3384.000000  7566.000000    950.000000     0.000000  10.000000
25%    7521.000000  7698.000000   1250.000000     0.000000  20.000000
50%    7782.000000  7782.500000   2450.000000     0.000000  20.000000
75%    7900.000000  7839.000000   3000.000000   400.000000  30.000000
max    9999.000000  8768.000000  20000.000000  1400.000000  80.000000

In [56]:
print(df4.shape)
print(df3.shape)

(21, 8)
(3, 2)

In [64]:
print(df4.columns)
print(df3.columns)

Index(['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno'], dtype='object')
Index(['Name', 'id'], dtype='object')

In [68]:
print(df4.index)
print(df3.index)

RangeIndex(start=0, stop=21, step=1)
RangeIndex(start=0, stop=3, step=1)

# Selection

In [18]:
print(df4.loc[0,"empno"])
print(df4.loc[0,"ename"])

7839
KING

In [34]:
print(df.iloc[0,1])  
print(df4.iloc[0,2])

3
PRESIDENT

In [38]:
print(df.at[0,"A"])
print(df4.at[5,"ename"])

1
FORD

In [48]:
print(df.iat[0,1])
print(df4.iat[5,2])

3
ANALYST

In [52]:
print(df.filter(items=["A","B"]))
print(df4.filter(items=["ename","job"]))

   A  B
0  1  3
1  2  4
     ename        job
0     KING  PRESIDENT
1    BLAKE    MANAGER
2    CLARK    MANAGER
3    JONES    MANAGER
4    Scott    ANALYST
5     FORD    ANALYST
6    SMITH      CLERK
7    ALLEN   SALESMAN
8     WARD   SALESMAN
9   MARTIN   SALESMAN
10  TURNER   SALESMAN
11   ADAMS      CLERK
12   JAMES      CLERK
13  MILLER      CLERK
14   tuski       None
15     eef       None
16    ewfe       None
17   SURYA       None
18   KRISH   SALESMAN
19  SURESH      CLERK
20     RAM    ANALYST

# indexing

In [20]:
# print(df4.set_index("ename"))
# print(df4.reset_index())
#print(df4.sort_index())

    empno   ename        job     mgr    hiredate      sal    comm  deptno
0    7839    KING  PRESIDENT     NaN  1981-11-17   5000.0     NaN    10.0
1    7698   BLAKE    MANAGER  7839.0  1981-05-01   2850.0     NaN    30.0
2    7782   CLARK    MANAGER  7839.0  1981-06-09   2450.0     NaN    10.0
3    7566   JONES    MANAGER  7839.0  1981-04-02   2975.0     NaN    20.0
4    7788   Scott    ANALYST  7566.0  1987-07-13   3000.0     NaN    20.0
5    7902    FORD    ANALYST  7566.0  1981-12-03   3000.0     NaN    20.0
6    7369   SMITH      CLERK  7902.0  1980-12-17   3000.0     NaN    20.0
7    7499   ALLEN   SALESMAN  7698.0  1981-02-20   1600.0   300.0    30.0
8    7521    WARD   SALESMAN  7698.0  1981-02-22   1250.0   500.0    30.0
9    7654  MARTIN   SALESMAN  7698.0  1981-09-28   1250.0  1400.0    30.0
10   7844  TURNER   SALESMAN  7698.0  1981-09-08   1500.0     0.0    30.0
11   7876   ADAMS      CLERK  7788.0  1987-07-13   1100.0     NaN    20.0
12   7900   JAMES      CLERK  7698.0  1981-12-03    950.0     NaN    30.0
13   7934  MILLER      CLERK  7782.0  1982-01-23   1300.0     NaN    10.0
14   7777   tuski       None     NaN  1991-02-14      NaN     NaN     NaN
15   8888     eef       None     NaN  1991-12-12      NaN     NaN     NaN
16   3385    ewfe       None     NaN  1991-12-17      NaN     NaN     NaN
17   9090   SURYA       None     NaN  1990-12-12      NaN     NaN     NaN
18   3384   KRISH   SALESMAN  7783.0  1999-10-12   5000.0     0.0    10.0
19   9999  SURESH      CLERK  7785.0  1999-12-19   1200.0     0.0    20.0
20   3507     RAM    ANALYST  8768.0  1998-10-16  20000.0     0.0    80.0

# Manipulation

In [68]:
# Column and Row operations.

df=df.assign(C=[5,6])
print(df)
df=df.drop(columns=['C'])
print(df)
df = df.rename(columns={'A':'Alpha'})
print(df)
df5 = pd.DataFrame({'A':[3],'B':[7]})
print(df5)
df= df.append(df5, ignore_index=True)
print(df)

   Alpha  B  C
0      1  3  5
1      2  4  6
   Alpha  B
0      1  3
1      2  4
   Alpha  B
0      1  3
1      2  4
   A  B
0  3  7

AttributeError: 'DataFrame' object has no attribute 'append'

# Slicing

In [35]:
print(df4.loc[0:5])
print(df4.iloc[0:5])
print(df4[df4["sal"]>3000])

   empno  ename        job     mgr    hiredate     sal  comm  deptno
0   7839   KING  PRESIDENT     NaN  1981-11-17  5000.0   NaN    10.0
1   7698  BLAKE    MANAGER  7839.0  1981-05-01  2850.0   NaN    30.0
2   7782  CLARK    MANAGER  7839.0  1981-06-09  2450.0   NaN    10.0
3   7566  JONES    MANAGER  7839.0  1981-04-02  2975.0   NaN    20.0
4   7788  Scott    ANALYST  7566.0  1987-07-13  3000.0   NaN    20.0
5   7902   FORD    ANALYST  7566.0  1981-12-03  3000.0   NaN    20.0
   empno  ename        job     mgr    hiredate     sal  comm  deptno
0   7839   KING  PRESIDENT     NaN  1981-11-17  5000.0   NaN    10.0
1   7698  BLAKE    MANAGER  7839.0  1981-05-01  2850.0   NaN    30.0
2   7782  CLARK    MANAGER  7839.0  1981-06-09  2450.0   NaN    10.0
3   7566  JONES    MANAGER  7839.0  1981-04-02  2975.0   NaN    20.0
4   7788  Scott    ANALYST  7566.0  1987-07-13  3000.0   NaN    20.0
    empno  ename        job     mgr    hiredate      sal  comm  deptno
0    7839   KING  PRESIDENT     NaN  1981-11-17   5000.0   NaN    10.0
18   3384  KRISH   SALESMAN  7783.0  1999-10-12   5000.0   0.0    10.0
20   3507    RAM    ANALYST  8768.0  1998-10-16  20000.0   0.0    80.0

In [25]:
import pandas as pd
sales_data = {
    'OrderID': [101, 102, 103],
    'Customer': ['Ajay', 'Kiran', 'Suresh'],
    'Amount': [250, 300, 150],
    'Status': ['Completed', 'Pending', 'Completed']
}

df = pd.DataFrame(sales_data)
print("Initial DataFrame:")
print(df)

Initial DataFrame:
   OrderID Customer  Amount     Status
0      101     Ajay     250  Completed
1      102    Kiran     300    Pending
2      103   Suresh     150  Completed

In [29]:
# Adding rows
# Add a new order (row)
# df.loc[len(df)] = [104,"Ravi",400,"Pending"]
# print(df)
# Add multiple orders
new_orders = pd.DataFrame({
'OrderID':[105, 106],
'Customer': ['Kishore','Amar'],
'Amount': [500, 350],
'Status': ['Completed','Pending']
})
df = pd.concat([df, new_orders], ignore_index=True)
print(df)
# df = pd.DataFrame(new_orders)
# df_cleaned = df.drop_duplicates()
# print(df_cleaned)

   OrderID Customer  Amount     Status
0      101     Ajay     250  Completed
1      102    Kiran     300    Pending
2      103   Suresh     150  Completed
3      104     Ravi     400    Pending
4      105  Kishore     500  Completed
5      106     Amar     350    Pending

In [35]:
# Update rows
# df.loc[df['Status'] == 'Pending', 'Status'] = 'Completed';
# print(df)
df.loc[df['Amount'] > 400, 'Amount'] *= 0.9 # Apply a 10% discount
print(df)

   OrderID Customer  Amount     Status
0      101     Ajay     250  Completed
1      102    Kiran     300  Completed
2      103   Suresh     150  Completed
3      104     Ravi     400  Completed
4      105  Kishore     450  Completed
5      106     Amar     350  Completed

In [37]:
# Deleting rows
df = df[df['Status'] != 'Canceled']
print(df)

   OrderID Customer  Amount     Status
0      101     Ajay     250  Completed
1      102    Kiran     300  Completed
2      103   Suresh     150  Completed
3      104     Ravi     400  Completed
4      105  Kishore     450  Completed
5      106     Amar     350  Completed

In [61]:
# categorized data
def categorize_order(amount):
    if amount <= 200:
        return "Low"
    elif 201 <= amount <= 400:
        return 'Medium'
    else:
        return 'High'
df['Category'] = df['Amount'].apply(categorize_order)
print(df)

   OrderID Customer  Amount     Status Category
0      101     Ajay     250  Completed   Medium
1      102    Kiran     300  Completed   Medium
2      103   Suresh     150  Completed      Low
3      104     Ravi     400  Completed   Medium
4      105  Kishore     450  Completed     High
5      106     Amar     350  Completed   Medium

In [63]:
# Aggregating Data
category_sales = df.groupby('Category')['Amount'].sum()
print(category_sales)

Category
High       450
Low        150
Medium    1300
Name: Amount, dtype: int64

In [69]:
# Sorting and saving data
df.to_csv('sales_data.csv', index=False)

None

In [35]:
# Aligning Data
import pandas as pd
df1=pd.DataFrame({"A":[1,2]},index=["a","b"])
df2=pd.DataFrame({"B":[3,4]},index=["b","c"])
# df3=df1.align(df2,join="outer")
# print(df3)
result=pd.merge(df1,df2,left_index=True,right_index=True,how="outer")
print(result)
result1=pd.merge(df1,df2,left_index=True,right_index=True,how="inner")
print(result1)
result2=pd.merge(df1,df2,left_index=True,right_index=True,how="left")
print(result2)

     A    B
a  1.0  NaN
b  2.0  3.0
c  NaN  4.0
   A  B
b  2  3
   A    B
a  1  NaN
b  2  3.0

In [59]:
# Cross tab and pivot table
import pandas as pd
data={"Gender":["Male","Female","Male","Female","Male"],
      "Category":["A","A","B","B","B"],
      "Score":[95,90,78,92,88]}
df=pd.DataFrame(data)
# crosstab
ct=pd.crosstab(df["Gender"],df["Category"],values=df["Score"],aggfunc="mean",margins=True)
print(ct)
# ct.to_excel("cross_tab.xlsx",index=True)
# Pivot table
pt=df.pivot_table(values="Score",index="Gender",columns="Category",aggfunc="sum",margins=True)
print(pt)

Category     A     B   All
Gender
Female    90.0  92.0  91.0
Male      95.0  83.0  87.0
All       92.5  86.0  88.6
Category    A    B  All
Gender
Female     90   92  182
Male       95  166  261
All       185  258  443